% Example 7.9

n = 0:100000; N = length(n);
x1 = 2*sin(0.1*pi*n);      		% Περιοδικό σήμα x1[n]
x2 = 2*sin(0.1*3.1*n);     		% Μη περιοδικό σήμα x2[n]
Px1 = sum(x1.^2) / (2*N+1)   	  	% Μέση ισχύς σήματος x1[n]
Px2 = sum(x2.^2) / (2*N+1)    	     	% Μέση ισχύς σήματος x2[n]
P1 = sum(x1(1:20).^2) / (20)	       	% Μέση ισχύς x1[n] σε μία περίοδο
stem(n(1:40), x1(1:40), 'r'); grid on   % Σχεδιασμός x1[n] για 2 περιόδους
hold on; stem(n(1:40), x2(1:40), 'b') 	% Σχεδιασμός x2[n] για 2 περιόδους