% Example 7.12 & 7.13
% Υπολογισμός κρουστικής απόκρισης των συστημάτων
% y1[n] = -0.5y[n-1]+x[n]-x[n-1]
% y2[n] = x[n]-x[n-1]

clc; clear all; clf;

N = 10; n = 0:N-1;  % Δημιουργία κλίμακας χρόνου

% Δημιουργία κρουστικής συνάρτησης δ[n]
d = zeros(1,N); 
d(n==0) = 1;

% Υπολογισμός κρουστικών αποκρίσεων
h1(1) = d(1);
h2(1) = d(1);
for i = 2:N
    h1(i) = -0.5*h1(i-1)+d(i)-d(i-1);
    h2(i) = d(i)-d(i-1);
end

% Σχεδιασμός κρουστικών αποκρίσεων 
subplot(211); stem(n, h1); ylim([-1.5, 1.5])
title('h[n] για το IIR σύστημα'); grid on;
subplot(212); stem(n, h2); ylim([-1.5, 1.5])
title('h[n] για το FIR σύστημα'); grid on;
