% Example 11.7 (Part A)
%clc; clear all; clf

Fs = 10000; % Συχνότητα δειγματοληψίας

% Συχνότητες αποκοπής στο διάστημα [0,π]
wp = 0.2*pi; ws = 0.40*pi; 

% Συχνότητες αποκοπής στο διάστημα [0,Fs/2]
fp = wp*Fs/(2*pi);  fs = ws*Fs/(2*pi);

As = 50;	% Εξασθένιση στη ζώνη αποκοπής (dB)
R = 0.1;    % Αρχική τιμή κύμανσης στη ζώνη διέλευσης

i = 0;

while R <= 2.0;
    i = i+1; R = R+0.05; Rp(i) = R;
    % Απόκλιση πλάτους στις ζώνες διέλευσης και αποκοπής 
    dp = (10^(R/20)-1)/(10^(R/20)+1);
    ds = (1+dp)*(10^(-As/20));
    % Καθορισμός προδιαγραφών φίλτρου
    F = [fs fp]; A = [0 1]; Deviation = [dp ds]; 
    % Υπολογισμός βέλτιστης τάξης φίλτρου με firpmord()
    [No3(i), Fo, Ao, Weights] = firpmord(F, A, Deviation, Fs);
    % Υπολογισμός βέλτιστης τάξης φίλτρου με Kaiser
    Nk3(i) = ceil( (-20*log10(sqrt(dp*ds))-13 ) / (2.285*(ws-wp)) - 1 );
end

