% Example 11.11
clc; clear all

Wp = 0.25*pi; 	% Συχνότητα στη ζώνη διέλευσης 
Ws = 0.55*pi; 	% Συχνότητα στη ζώνη αποκοπής 
Rp = 0.5;     	% Εξασθένιση στη ζώνη διέλευσης 
As = 10;     	% Εξασθένιση στη ζώνη αποκοπής 

% Υπολογισμός τάξης (σχέση 11.71)
N = (log10((10^(Rp/10)-1)/(10^(As/10)-1))/(2*log10(Wp/Ws)))
N = ceil(N)

% Υπολογισμός συχνότητας αποκοπής (σχέση 11.72) 
Wc1 = Wp / ( (10^(Rp/10)-1) ^ (1/(2*N)) )
% Υπολογισμός συχνότητας αποκοπής (σχέση 11.73)
Wc2 = Ws / ( (10^(As/10)-1) ^ (1/(2*N)) )

% Σχεδιασμός του φίλτρου με δεδομένα Ν και Ωc
N = 3; Wc = 1.15;

% Υπολογισμός πόλων αναλογικού φίλτρου
k = 0:1:2*N-1; p = Wc * exp(j*(2*k+N+1)*pi/(2*N));

% Πόλοι του πρότυπου αναλογικού φίλτρου
% δηλαδή για Wc = 1 (rad/sec)
p = p / Wc

% Σχεδιασμός απόκρισης συχνότητας φίλτρου
b = 1.15; a = [1, 2.3, 2.645, 1.521]; 
[z,p,k] = residue(b,a)
freqs(p,z)