% Example 2.6 (A)

syms t
u(t) = heaviside(t); a1 = 2;  a2 = 3;
x1 = u(t) - u(t-1);      % Ορισμός σήματος x1(t)
x2 = u(t-2) - u(t-3);    % Ορισμός σήματος x2(t)
y1 = t*x1;               % Υπολογισμός εξόδου y1(t)
y2 = t*x2;               % Υπολογισμός εξόδου y2(t)

% Υπολογισμός εξόδου ως γραμμικός συνδυασμός των εξόδων y1(t) και y2(t)
y12 = a1*y1 + a2*y2; 

% Υπολογισμός εισόδου x(t) ως γραμμικός συνδυασμός των x1(t) και x2(t)
x = a1*x1 + a2*x2;
y = t*x;                 % Υπολογισμός εξόδου για είσοδο x(t)

% Σχεδιασμός σημάτων και σύγκριση μεταξύ y(t) και y12(t)
subplot(121); fplot(y, [-1 4]); ylim([0 10]); grid on; title('y(t)')
subplot(122); fplot(y12, [-1 4],'m'); ylim([0 10]); grid on; title('y_1_2(t)')