% Example 13.11
clear all; clc

% Ορισμός προδιαγραφών του φίλτρου
Wp = 0.25*pi; Ws = 0.55*pi; Rp = 0.5; As = 10;     	 

% Υπολογισμός τάξης (σχέση 11.71)
N = ceil(log10((10^(Rp/10)-1)/(10^(As/10)-1))/(2*log10(Wp/Ws)))

% Υπολογισμός συχνότητας αποκοπής (σχέση 13.80) 
Wc1 = Wp / ( (10^(Rp/10)-1) ^ (1/(2*N)) )

% Υπολογισμός συχνότητας αποκοπής (σχέση 13.81)
Wc2 = Ws / ( (10^(As/10)-1) ^ (1/(2*N)) )

N = 3; Wc = 1.15; % Σχεδιασμός του φίλτρου με δεδομένα Ν και Ωc
k = 0:1:2*N-1; p = Wc * exp(j*(2*k+N+1)*pi/(2*N)); % Υπολογισμός πόλων

% Σχεδιασμός απόκρισης συχνότητας φίλτρου
b=1.521; a=[1, 2.3, 2.645, 1.521]; 
[z,p,k]=residue(b,a), freqs(p,z)