% Example 13.4

clear all; clc;

N = 10; % Πλήθος δειγμάτων

% Δημιουργία διανύσματος συχνοτήτων δειγματοληψίας ωk=(2π/N)k
k = 0 : 1 : (N-1);
wk = 0 : 2*pi/N : 2*pi-(2*pi/N);

% Παραγωγή δειγμάτων Η[k] με δειγματοληψία ιδανικής απόκρισης Hd(e^jω)
H = ones(1, length(wk)); H(4:8) = 0;  

% Υπολογισμός κρουστικής απόκρισης από τη σχέση (13.44)
for n = 0:1:N-1;
 h(n+1)=(1/N)*(1 + exp(j*2*pi*n/N) + exp(j*4*pi*n/N) + exp(j*16*pi*n/N) + exp(j*18*pi*n/N));
end

% Σχεδιασμός ακολουθίας Η[k] και κρουστικής απόκρισης h[n]
figure(1); subplot(121); stem(wk/pi, H); grid on; ylim([-0.2, 1.2]); 
title('Aπόκριση συχνότητας H[k]');
subplot(122);stem(0:1:N-1,h); grid on; title('Κρουστική απόκριση h[n]')

% Σχεδιασμός απόκρισης συχνότητας προσεγγιστικού φίλτρου στο διάστημα [0,π]
figure(2); freqz(h,128);