% Example 13.12 (B)
clear all; clc

Td = 0.1; Fd = 1/Td; 		% Περίοδος και συχνότητα δειγματοληψίας της κρου-στικής
b = [3 7]; a = [1 4 3] 		% Δοθέν αναλογικό φίλτρο
[Hs, Ws] = freqs(b, a, 512); 	% Συνάρτηση μεταφοράς αναλογικού φίλτρου
[bz, az] = impinvar(b, a, Fd); 	% Μέθοδος αμετάβλητης κρουστικής απόκρισης
[Hz, Wz] = freqz(bz, az, 512, Fd); 	% Συνάρτηση μεταφοράς ψηφιακού φίλτρου

% Σχεδιασμός φασμάτων αναλογικού και ψηφιακού φίλτρου
semilogx(Ws/(2*pi),20*log10(abs(Hs)),'LineWidth',2);hold on; grid on;
semilogx(Wz, 20*log10(abs(Hz)),'r--'); xlabel('Συχνότητα (Hz)'); 
ylabel('Πλάτος (dB)'); legend('Αναλογικό φίλτρο','Ψηφιακό φίλτρο');
