% Figure 13.5
clear all; clc

n1 = 0:1:10; % Ν = 11
h1 = [0.1, -0.2, 0.3, -0.4, 0.7, 0.9, 0.7, -0.4, 0.3, -0.2, 0.1];
h3 = [-0.1, 0.2, -0.3, 0.4, -0.7, 0.9, 0.7, -0.4, 0.3, -0.2, 0.1];

n2 = 0:1:9;  % Ν = 10
h2 = [0.1, -0.2, 0.3, -0.4, 0.7, 0.7, -0.4, 0.3, -0.2, 0.1];
h4 = [-0.1, 0.2, -0.3, 0.4, -0.7, 0.7, -0.4, 0.3, -0.2, 0.1];

subplot(221); stem(n1, h1); grid on; ylim([-1, 1]); title('(α) FIR Τύπου 1 (Ν=11)')
subplot(222); stem(n2, h2); grid on; ylim([-1, 1]); title('(β) FIR Τύπου 2 (Ν=10)')
subplot(223); stem(n1, h3); grid on; ylim([-1, 1]); title('(γ) FIR Τύπου 3 (Ν=11)')
subplot(224); stem(n2, h4); grid on; ylim([-1, 1]); title('(δ) FIR Τύπου 4 (Ν=10)')