% Example 12.18

clear all; clc

% Δημιουργία ακολουθιών x[n], h[n]
x = [1,1,2,-1,0,2,3,-2,2,1,-1,2]; 
h = [1,0,-1];
N = 5;				% Ορισμός μήκους τμήματος
Lx = length(x); M = length(h); 	% Lx μήκος x[n], M μήκος h[n]
h = [h zeros(1, N-M)];  	% Προσθήκη NM μηδενικών στο τέλος της h[n]
H = fft(h, N);			% Υπολογισμός DFT H[k] Ν σημείων

% Προσθήκη M1 μηδενικών στην αρχή και Ν1 μηδενικών στο τέλος της x[n]
x = [zeros(1,M-1), x, zeros(1, N-1)]; 
L = N-M+1;			% L πλήθος σωστών δειγμάτων ανά τμήμα
R = floor((Lx+M-2)/L);	    	% R πλήθος τμημάτων σήματος εισόδου
y = zeros(R+1, N);		% Προετοιμασία ακολουθίας εξόδου

% Υπολογισμός κυκλικής συνέλιξης μέσω DFT
for r = 0:R
    xr = x(r*L+1:r*L+N);	% Δημιουργία τμήματος xr[n]
    Xr = fft(xr, N); 		% Υπολογισμός DFT Χr[k] Ν σημείων
    Yr = Xr .* H;
    y(r+1,:) = ifft(Yr,N);
end
y = y(:, M:N)';			% Απόρριψη Μ1 πρώτων δειγμάτων
y = (y(:))'			% Δημιουργία ακολουθίας εξόδου

