% Example 12.17
clear all; clc

% Ορισμός συχνότητας και περιόδου δειγματοληψίας
fs = 1000; Ts = 1/fs;

% Δημιουργία κλίμακας χρόνου και συχνότητας
N = 80; n = [0:N-1]; f = fs*(0:N/2-1)/N;

% Δημιουργία σήματος με θόρυβο
xa = sin(200*pi*n*Ts) + sin(700*pi*n*Ts);
x = xa + rand(1,length(xa));

% Υπολογισμός DFT Χ[k] Ν-σημείων
X = fft(x, N);

% Υπολογισμός φασματικής πυκνότητας ενέργειας
Sx = abs(X.^2) / N;

% Σχεδιασμός σήματος και φασματικής πυκνότητας ενέργειας
subplot(121); plot(n, x, 'm'); title('Σήμα με θόρυβο'); grid on
subplot(122); stem(f, Sx(1:N/2)); title('Φασματική πυκνότητα ενέργειας'); grid on