% Example 9.4

clf; clc; clear all

B = pi/2;
N = 25;    % Ν: πλήθος σημείων άξονα συχνοτήτων
w = [-pi:pi/N:pi]; % Διαίρεση περιοχής [-π,π] σε Ν σημεία

X = [0,0,0,0,0, 0, 0, 0,0,0,0,0,0,0, 1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1, 1, 1, 1,1, 0,0, 0, 0,0, 0, 0,0,0,0,0,0,0,0,0,0,0,0];

n = [-N:N];
x = sin(B.*n) ./ (pi.*n);
x(n==0)= B/pi;

% Σχεδιασμός φασμάτων πλάτους και φάσης
 subplot(211)
plot(w/pi, X(1:51)); grid; xlim([-1.5,1.5]); ylim([-0.5, 1.5]);
xlabel('Συχνότητα [0,π]'); title('|X(e^j^ω)|'); 

subplot(212);
stem(n, x); grid; ylim([-0.2 0.6])
xlabel('Χρόνος'); title('x[n]'); 
