% Example 9.?

% Η(e^jω ) = (1-a e^-jω)
clf; clc; clear all

% H(e^jω )=Y(e^jω )/X(e^jω ) =(1+2e^(-jω)+e^(-j2ω))/(1-0.5e^(-jω) )

N = 100;    % Ν: πλήθος σημείων άξονα συχνοτήτων

w = [0:1:N] * (pi/N); % Διαίρεση περιοχής [0,π] σε Ν σημεία

X = (1 - 0.5 * exp(-j*w) );  % Υπολογισμός Χ(e^jω)
Y = (1 + 2 * exp(-j*w) + exp(-j*2*w));  % Υπολογισμός Y(e^jω)

H = Y ./ X; % Υπολογισμός απόκρισης συχνότητας H(e^jω )

% Σχεδιασμός φασμάτων πλάτους και φάσης
subplot(211), plot(w/pi, abs(H)); grid; xlim([0,1])
xlabel('Συχνότητα [0,π]'); title('Μέτρο DTFT |H(e^j^ω)|'); 

subplot(212), plot(w/pi, angle(H)); grid; xlim([0,1])
xlabel('Συχνότητα [0,π]'); title('Φάση DTFT <H(e^j^ω)'); 
