% Example 2.4
clc; clear all;

syms t
u(t) = heaviside(t); a1 = 2;  a2 = 3;
x1(t) = u(t) - u(t-1);  	% Ορισμός σήματος x1(t)
x2(t) = u(t-2) - u(t-3);  % Ορισμός σήματος x2(t)
y1(t) = t*x1(t);    % Υπολογισμός εξόδου y1(t)
y2(t) = t*x2(t);    % Υπολογισμός εξόδου y2(t)
% Υπολογισμός εξόδου ως γραμμικός συνδυασμός των εξόδων y1(t) και y2(t)
y12(t) = a1*y1(t) + a2*y2(t); 
% Υπολογισμός εισόδου x(t) ως γραμμικός συνδυασμός των x1(t) και x2(t)
x(t) = a1*x1(t) + a2*x2(t);
y(t) = t*( x(t) ); % Υπολογισμός εξόδου για είσοδο x(t)
% Σχεδιασμός σημάτων και σύγκριση μεταξύ y(t) και y12(t)
subplot(211); ezplot(y(t), [-1 4]); ylim([0 10]); grid on
subplot(212); ezplot(y12(t), [-1 4]); ylim([0 10]); grid on

