% Example 10.15

clear all; clc

% Δημιουργία κλίμακας χρόνου
%n = [0:2];
% Δημιουργία ακολουθιών x[n], h[n]
x = [1 1 2 -1 0 -2 3 -2 2 1 -1 2]; h = [1, 0, -1];

% Ορισμός μήκους τμήματος
N = 5;
% Lx μήκος x[n], M μήκος h[n]
Lx = length(x); M = length(h);
% Προσθήκη N-M μηδενικών στο τέλος της h[n]
h = [h zeros(1, N-M)]; 
% Υπολογισμός DFT H[k] Ν-σημείων
H = fft(h, N);
% Προσθήκη M-1 μηδενικών στην αρχή 
% και Ν-1 μηδενικών στο τέλος της x[n]
x = [zeros(1,M-1), x, zeros(1, N-1)]; 
% L πλήθος σωστών δειγμάτων ανά τμήμα
L = N-M+1;
% R συνολικό πλήθος τμημάτων σήματος εισόδου
R = floor((Lx+M-2)/L);
% Προετοιμασία ακολουθίας εξόδου
y = zeros(R+1, N);
% Υπολογισμός κυκλικής συνέλιξης μέσω DFT
for r = 0:R
    xr = x(r*L+1 : r*L+N); % Δημιουργία τμήματος xr[n]
    Xr = fft(xr, N); % Υπολογισμός DFT Χr[k] Ν-σημείων
    Yr = Xr .* H;
    y(r+1,:) = ifft(Yr,N);
end
% Απόρριψη Μ-1 πρώτων δειγμάτων
y = y(:, M:N)';
% Δημιουργία ακολουθίας εξόδου
y = (y(:))'
