% Example 10.25
clear all; clc

l = 0.7;
b = [1-l^2]                 % Συντελεστές πολυωνύμου αριθμητή
a = [-l, (1+l^2), -l ]      % Συντελεστές πολυωνύμου παρονομαστή
H = freqz(b,a)              % Υπολογισμός συνάρτησης μεταφοράς
N = length(H);              % Ν: Μήκος απόκρισης συχνότητας
w_norm = 0:1/N:(1-1/N);     % Κανονικοποιημένη συχνότητα

% Σχεδιασμός φάσματος πλάτους |H(e^jω)| σε dB
subplot(121); plot(w_norm, 20*log10(abs(H))); grid on;
xlabel('Κανονικοποιημένη συχνότητα'); title('|H(e^j^ω)|'); 

% Σχεδιασμός φάσματος φάσης <H(e^jω) 
subplot(122); plot(w_norm, (angle(H)),'r'); grid on;
xlabel('Κανονικοποιημένη συχνότητα'); title('<H(e^j^ω)');