% Example 11.22 (A Run)
clc; clear all; clf

% Συντελεστές αριθμητή και παρανομαστή της Σ.Μ.
b = [1 -0.816];
a = [1 -1.927 0.928176];

% Υπολογισμός συνάρτησης μεταφοράς (Σ.Μ.)
H = tf(b,a,1)

% Εύρεση πόλων και μηδενικών
p = pole(H), z = zero(H)

% Υπολογισμός αναπτύγματος σε μερικά κλάσματα
[R,p,C] = residuez(b,a)

%h[n]= [ 6.44 x 0.976^n - 5.44 ^n ] u[n]

% Υπολογισμός κρουστικής απόκρισης 
n = [0:100]; h = R(1)*p(1).^n + R(2)*p(2).^n;

% Σχεδιασμός κρουστικής απόκρισης 
% και διαγράμματος πόλων - μηδενικών
subplot(121); stem(n, h); grid on
subplot(122); zplane(z,p);


% h: Κρουστική απόκριση με επίλυση ΓΕΔΣΣ
% n = [0:200]; d = zeros(1, length(n)); d(1, n==0) = 1;
% h = filter(b, a, d);
