% Example 11.4
clc; clf ; clear all

N = 10; % Πλήθος δειγμάτων

% Δημιουργία διανύσματος συχνοτήτων δειγματοληψίας ωk=(2π/N)k
k = 0 : 1 : (N-1);
wk = 0 : 2*pi/N : 2*pi-(2*pi/N);

% Δημιουργία δειγμάτων Η[k] από δειγματοληψία ιδανικής απόκρισης Hd(e^jω)
H = ones(1, length(wk)); H(4:8) = 0;  

% Υπολογισμός κρουστικής απόκρισης από τη σχέση 11.30
for n = 0:1:N-1;
 h(n+1)=(1/N)*(1 + exp(j*2*pi*n/N) + exp(j*4*pi*n/N) + exp(j*16*pi*n/N) + exp(j*18*pi*n/N));
end

% Σχεδιασμός ακολουθίας δειγμάτων Η[k] και κρουστικής απόκρισης h[n]
figure(1); 
subplot(121); stem(wk/pi, H); grid on; ylim([-0.2, 1.2]); 
title('(α) Aπόκριση συχνότητας H[k]');
subplot(122); stem(0:1:N-1, h); grid on; title('(β) Κρουστική απόκριση h[n]')

% Σχεδιασμός απόκρισης συχνότητας προσεγγιστικού φίλτρου στο διάστημα [0,π]
figure(2)
freqz(h, 128);