% Example 11.22 (B Run)
clc; clear all; clf

% Συντελεστές αριθμητή και παρανομαστή της Σ.Μ.
b = [1 -0.82];
a = [1 -1.93 0.93];

% Υπολογισμός συνάρτησης μεταφοράς (Σ.Μ.)
H = tf(b,a,1)

% Εύρεση πόλων και μηδενικών
p = pole(H), z = zero(H)

% Υπολογισμός αναπτύγματος σε μερικά κλάσματα
[R,p,C] = residuez(b,a)

% Υπολογισμός κρουστικής απόκρισης 
n = [0:100]; h = R(1)*p(1).^n + R(2)*p(2).^n;

% Σχεδιασμός κρουστικής απόκρισης 
% και διαγράμματος πόλων - μηδενικών
subplot(121); stem(n, h); grid on
subplot(122); zplane(z,p);
