% Example 11.6
clc; clear all; clf

Fs = 10000; % Συχνότητα δειγματοληψίας

% Συχνότητες αποκοπής στο διάστημα [0,π]
w1s = 0.2*pi; w1p = 0.25*pi; w2p = 0.7*pi; w2s = 0.75*pi

% Συχνότητες αποκοπής στο διάστημα [0,Fs/2]
f1s = w1s*Fs/(2*pi);  % Συχνότητα αποκοπής ζώνης αποκοπής
f1p = w1p*Fs/(2*pi);  % Συχνότητα αποκοπής ζώνης διέλευσης
f2p = w2p*Fs/(2*pi);  % Συχνότητα αποκοπής ζώνης διέλευσης
f2s = w2s*Fs/(2*pi);  % Συχνότητα αποκοπής ζώνης αποκοπής

Rp = 1.0; 	% Κύμανση στη ζώνη διέλευσης (dB)
As = 50;	% Εξασθένιση στη ζώνη αποκοπής (dB)

%Απόκλιση πλάτους στη ζώνη διέλευσης
dp = (10^(Rp/20)-1)/( 10^(Rp/20)+1)

% Απόκλιση πλάτους στη ζώνη αποκοπής
ds = (1+dp)*(10^(-As/20))

% Καθορισμός προδιαγραφών φίλτρου
F = [f1s f1p f2p f2s]; A = [0 1 0]; Deviation = [ds dp ds]; 

% Υπολογισμός βέλτιστης τάξης φίλτρου
[N, Fo, Ao, Weights] = firpmord(F, A, Deviation, Fs)

% Υπολογισμός κρουστικής απόκρισης με Parks-McClellan
h = firpm(N, Fo, Ao, Weights);  

% Σχεδιασμός κρουστικής απόκρισης FIR φίλτρου
n = 0:1:N;  figure(1); stem(n, h); grid on; 
title('Κρουστική απόκριση FIR φίλτρου')

% Σχεδιασμός απόκρισης συχνότητας FIR φίλτρου
figure(2); freqz(h, 1, 512, Fs); axis([0, Fs/2 -80 10])
title('Aπόκριση συχνότητας FIR φίλτρου')