% Example 11.12 (β)

% Δοθέν αναλογικό φίλτρο
b = [3 7]; a = [1 4 3]

% Συνάρτηση μεταφοράς αναλογικού φίλτρου
[Hs, Ws] = freqs(b, a, 512);  

% Συχνότητα δειγματοληψίας
Td = 0.1; Fd = 1/Td; 

% Μέθοδος αμετάβλητης κρουστικής απόκρισης
[bz, az] = impinvar(b, a, Fd);

% Συνάρτηση μεταφοράς ψηφιακού φίλτρου
[Hz, Wz] = freqz(bz, az, 512, Fd);

% Σχεδιασμός φασμάτων αναλογικού και ψηφιακού φίλτρου
figure(1);
semilogx(Ws/(2*pi), 20*log10(abs(Hs)),'LineWidth',2); 
hold on; semilogx(Wz, 20*log10(abs(Hz)),'r--'); grid on;
xlabel('Συχνότητα (Hz)'), ylabel('Πλάτος (dB)');
legend('Αναλογικό φίλτρο','Ψηφιακό φίλτρο');
hold off;
