n = [0:34];

x1 = [0,0,1,2,3,4,5,6,7,6,5,4,3,2,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0];
x2 = [0,1,3,5,7,5,3,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0];
x3 = [0,0,0,0,1,0,2,0,3,0,4,0,5,0,6,0,7,0,6,0,5,0,4,0,3,0,2,0,1,0,0,0,0,0,0];

subplot(311); stem(n,x1); grid on; ylim([0,8]);
title('Αρχικό σήμα x[n]')

subplot(312); stem(n,x2); grid on; ylim([0,8]);
title('Υποδειγματοληψία y[n]=x[Mn], M=2')

subplot(313); stem(n,x3); grid on; ylim([0,8]);
title('Υπερδειγματοληψία y[n]=x[n/N], N=2')
