% Example 4.7

clear all; clc

syms t
t0 = 0; T0 = 1; w0 = 2*pi/T0; A=1; N=10; 	%Ν πλήθος συντ. σειράς Fourier
x = abs( A*sin(pi*t) );                     % Ορισμός σήματος x(t)
a0 = (1/T0) * int(x, t, t0, t0+T0);     	% Σχέση (4.16)
c0 = a0;
% Υπολογισμός σχέσεων (4.17), (4.18), (4.19) και (4.20)
for k = 1 : N
   a(k) = (2/T0) * int(x*cos(k*w0*t), t, t0, t0+T0);  	% Σχέση (4.17)
   b(k) = (2/T0) * int(x*sin(k*w0*t), t, t0, t0+T0);	% Σχέση (4.18)
   c(k) = sqrt( (a(k))^2 + (b(k))^2 );                  % Σχέση (4.19)
   theta(k) = - atan( b(k) / a(k) );                    % Σχέση (4.20)
end
C = [c0 c]; % Τοποθέτηση όλων των συντελεστών c σε ένα διάνυσμα C
m = 0:N;   % Δημιουργία άξονα τιμών [0, Ν]

% Σχεδιασμός φάσματος πλάτους μονής πλευράς
figure(1); subplot(121); stem(m, C); grid on; title('Φάσμα πλάτους μονής πλευράς')
% Σχεδιασμός φάσματος φάσης μονής πλευράς
subplot(122); stem(theta, 'm'); grid on; title('Φάσμα φάσης μονής πλευράς')   

M = N/2;
for n = -M : M
   X(n+(M+1)) = (1/T0) * int(x*exp(-1i*w0*n*t),t,t0,t0+T0); % Σχέση (4.10)
end
figure(2); stem(-M:M, abs(X)); grid on


