% Example 11.16

N = 100;    		                 % Ν: πλήθος σημείων άξονα συχνοτήτων
w = [0:1:N] * (pi/N); 	                 % Διαίρεση περιοχής [0,π] σε Ν σημεία
Den = (1 - 0.5 * exp(-j*w) );            % Υπολογισμός παρονομαστή Η(e^jω)
Num = (1 + 2 * exp(-j*w) + exp(-j*2*w)); % Υπολογισμός αριθμητή Η(e^jω)
H = Num ./ Den; % Υπολογισμός απόκρισης συχνότητας H(e^jω)

% Σχεδιασμός φασμάτων πλάτους και φάσης
subplot(121), plot(w/pi, abs(H)); grid; xlim([0,1])
xlabel('Συχνότητα [0,π]'); title('Μέτρο DTFT |H(e^j^ω)|'); 
subplot(122), plot(w/pi, angle(H)); grid; xlim([0,1])
xlabel('Συχνότητα [0,π]'); title('Φάση DTFT <H(e^j^ω)');