% Example 11.10

% Ορισμός συντελεστών ΓΕΔΣΣ
b = [0.5, 0.5]; a = [1, -1, 1];

% Ορισμός αρχικών συνθηκών εξόδου y[-1], y[-2]
yic = [0.75, 0.25];  

% Υπολογισμός αρχικών συνθηκών εισόδου x[-1], x[-2]
xic = filtic(b, a, yic);
n = [0:29];  	 	% Ορισμός χρόνου
x = (0.5).^n;  		% Είσοδος x[n]

% Επίλυση ΓΕΔΣΣ με τη συνάρτηση filter()
y = filter(b, a, x, xic);
subplot(121); stem(n, x); title('Είσοδος x[n]'); ylim([0, 1.2]); grid on
subplot(122); stem(n, y); title('Έξοδος y[n]'); ylim([-1.2, 1.2]); grid on