% Example 11.9

% Ορισμός συντελεστών ΓΕΔΣΣ
b = [1]; a = [1, -0.2, -0.8];

% Ορισμός αρχικών συνθηκών εξόδου y[-1], y[-2]
yic = [5, 10];  

% Υπολογισμός αρχικών συνθηκών εισόδου x[-1], x[-2]
xic = filtic(b, a, yic)
n = [0:9];  	% Ορισμός διαστήματος χρόνου
x = (0.5).^n;  	% Είσοδος x[n]

% Επίλυση ΓΕΔΣΣ με τη συνάρτηση filter()
y1 = filter(b, a, x, xic)

% Υπολογισμός y[n] απο τη αναλυτική επίλυση
% y[n]= [(80/39) (-0.8)^n+(-10/26) (0.5)^n ]u[n]+(25/3)u[n]
y2 = [(80/39) * (-0.8).^n + (-10/26) * (0.5) .^n ] + (25/3)*ones(1,10)