% Example 11.18

n = [-10:10]; % Δημιουργία κλίμακας χρόνου
x = zeros(size(n));  x(n==0) = 1; % x[n] = δ[n]

% Συντελεστές b και a της ΓΕΔΣΣ
b = [1, 0, -1]; a = [1, -0.25];   

% Υπολογισμός εξόδου y[n] με επίλυση ΓΕΔΣΣ με filter()
y1 = filter(b,a,x);  
u = [zeros(1,10), ones(1,11)];      % u[n]
u2 = [zeros(1,10+2), ones(1,11-2)]; % u[n-2]

% Υπολογισμός εξόδου y[n] με επίλυση ΓΕΔΣΣ μέσω DTFT 
y2 = ((0.25).^n).*u - ((0.25).^(n-2)).*u2;
subplot(121), stem(n,y1); grid; title('y[n] μέσω συνάρτησης filter()'); 
subplot(122), stem(n,y2); grid; title('y[n] μέσω επίλυσης ΓΕΔΣΣ με DTFT');