% Example 11.15

a = 0.8;    		% Συντελεστής απόσβεσης της h[n] = a^n u[n]
N = 100;    		% Ν: πλήθος σημείων άξονα συχνοτήτων
w = [0:1:N] * (pi/N); 	% Διαίρεση περιοχής [0,π] σε Ν σημεία
H = 1 - a * exp(-j*w); 	% Υπολογισμός DTFT για α=0.8

% Σχεδιασμός φασμάτων πλάτους και φάσης
subplot(121), plot(w/pi, abs(H)); grid; xlim([0,1])
xlabel('Συχνότητα [0,π]'); title('Μέτρο DTFT |H(e^j^ω)|'); 
subplot(122), plot(w/pi, angle(H)); grid; xlim([0,1])
xlabel('Συχνότητα [0,π]'); title('Φάση DTFT <H(e^j^ω)');