% Example 8.37
clear all; clc

% Δημιουργία x[n] = δ[n]
N = 60; n = 0:N-1; x = zeros(size(n)); x(n==0) = 1;

% Ορισμός συντελεστών a και b
a = [1, 0.1, -0.72];  b = [1];

% Ορισμός αρχικών συνθηκών εξόδου 
IC = [0, 0];    

% Απόκριση μηδενικής εισόδου (ομογενής λύση)
yh = filter(b, a, zeros(1, N), filtic(b, a, IC));

% Απόκριση μηδενικής κατάστασης (μερική λύση)
yp = filter(b, a, x, filtic(b, a, [0, 0]));

% Συνολική απόκριση y[n] = yh[n] + yp[n]
h = yh + yp;

% Επίλυση της ΓΕΔΣΣ από θεωρία 
h1 = (8/17)*(0.8).^n + (9/17)*(-0.9).^n;

% Σχεδιασμός γραφικών παραστάσεων
subplot(121);stem(n,h);title('h[n] με συνάρτηση filter'); grid on
subplot(122);stem(n,h1,'r'); title('h[n] από θεωρία'); grid on